{
  "common": {
    "name": "twinkly",
    "version": "1.0.11-beta.1",
    "news": {
      "1.0.11-beta.1": {
        "en": "Updated Sentry logging for better viewability",
        "de": "Aktualisiertes Sentry Protokoll für bessere Sichtbarkeit",
        "ru": "Обновленная стружка Sentry для лучшего просмотра",
        "pt": "Registro de Sentry atualizado para melhor visibilidade",
        "nl": "Update Sentry op zoek naar beter zicht",
        "fr": "Mise à jour du logging Sentry pour une meilleure visibilité",
        "it": "Registrazione Sentry aggiornata per una migliore visibilità",
        "es": "Registro de centry actualizado para una mejor visualización",
        "pl": "Ulepszona praca Sentrylog for better viewability",
        "uk": "Оновлений журнал Sentry для кращої видимості",
        "zh-cn": "A. 更新的采样,以便更好地了解"
      },
      "1.0.11-beta.0": {
        "en": "Updated Sentry logging for better viewability",
        "de": "Aktualisiertes Sentry Protokoll für bessere Sichtbarkeit",
        "ru": "Обновленная стружка Sentry для лучшего просмотра",
        "pt": "Registro de Sentry atualizado para melhor visibilidade",
        "nl": "Update Sentry op zoek naar beter zicht",
        "fr": "Mise à jour du logging Sentry pour une meilleure visibilité",
        "it": "Registrazione Sentry aggiornata per una migliore visibilità",
        "es": "Registro de centry actualizado para una mejor visualización",
        "pl": "Ulepszona praca Sentrylog for better viewability",
        "uk": "Оновлений журнал Sentry для кращої видимості",
        "zh-cn": "A. 更新的采样,以便更好地了解"
      },
      "1.0.10": {
        "en": "Add sendTo message `uploadTwinkleMovie` to upload a twinkle movie with own colors\nUpdate Release Integration in Github Actions and Sentry",
        "de": "In den Warenkorb Zur Nachricht hochladenTwinkle Film zum Hochladen eines twinkle Films mit eigenen Farben\nVeröffentlichung Integration in Github Actions und Sentry",
        "ru": "Добавить отправить Чтобы загрузить сообщениеTwinkle Фильм для загрузки фильма twinkle с собственными цветами\nИнтеграция обновлений в Github Actions и Sentry",
        "pt": "Adicionar Para enviar mensagemTwinkle Filme para fazer upload de um filme twinkle com próprias cores\nIntegração de lançamento de atualização em ações do Github e Sentry",
        "nl": "Vertaling: Twinkle Film om een tweelingfilm te uploaden met eigen kleuren\nUpdate Release Integratie in Github Acties",
        "fr": "Ajouter envoyer Pour envoyer un messageTwinkle Film pour télécharger un film avec des couleurs propres\nMise à jour Intégration de la publication dans les actions Github et Sentry",
        "it": "Aggiungi Caricamento messaggioTwinkle Film per caricare un film twinkle con i propri colori\nIntegrazione del rilascio di aggiornamento in Github Azioni e Sentry",
        "es": "Agregar envío Para cargar mensajesTwinkle Película para subir una película con colores propios\nUpdate Release Integration in Github Actions and Sentry",
        "pl": "Wysyłać do wiadomości upload Movie wydało film z własnymi kolorami\nUchwalenie Integracji w Github Actions and Sentry",
        "uk": "Додати відправлення Для завантаження повідомлень Фільми для завантаження близнюків з власними квітами\nОновлення інтеграції релізів в Github Дії та Стоматології",
        "zh-cn": "增 编 D. 发出的信息 装有自己的颜色的双壳电影\nB. 吉隆布行动和Sentry的最新释放"
      },
      "1.0.9": {
        "en": "Now detects if Twinkly is in a group (firmware >= 2.8.3). If so, the group can only be controlled by the master, the states from the slave are read-only.",
        "de": "Erkennt nun, ob Twinkly in einer Gruppe ist (Firmware >= 2,8.3) Wenn ja, kann die Gruppe nur vom Master gesteuert werden, werden die Zustände vom Slave nur eingelesen.",
        "ru": "Теперь обнаруживает, если Twinkly находится в группе (подтверждение >= 2.8.3) Если это так, группа может контролироваться только мастером, государства от раба читаются только.",
        "pt": "Agora detecta se Twinkly está em um grupo (firmware >= 2.8.3) Se assim for, o grupo só pode ser controlado pelo mestre, os estados do escravo são somente leitura.",
        "nl": "Als Twinkly in een groep 2.8.3 is, kan de groep alleen beheerd worden door de meester, de staaten van de slaaf worden gelezen.",
        "fr": "Détecte maintenant si Twinkly est dans un groupe (firmware > 2.8.3) Si oui, le groupe ne peut être contrôlé que par le maître, les états de l'esclave sont lus seulement.",
        "it": "Ora rileva se Twinkly è in un gruppo (firmware >= 2.8.3) Se è così, il gruppo può essere controllato solo dal padrone, gli stati dello schiavo sono in sola lettura.",
        "es": "Ahora detecta si Twinkly está en un grupo (firmware √≥= 2.8.3) Si es así, el grupo sólo puede ser controlado por el maestro, los estados del esclavo son sólo lectura.",
        "pl": "Teraz wykrywa, jeśli Twinkly znajduje się w grupie (firmware >= 2.8.3) Jeśli tak, grupa może być kontrolowana przez mistrza, stany z niewolnika są odczytane.",
        "uk": "Тепер виявляє, якщо Twinkly є в групі (підтвердження>= 2.8.3) Якщо так, група може бути контрольована майстером, штати від раба читаються натільки.",
        "zh-cn": "现在发现,如果Twinkly是一群(肯定)=2.8.3),该团体只能由总长控制,那么奴隶的各州就读。."
      },
      "1.0.8": {
        "en": "Add `musicreactive` Mode\nAdd Ukrainian translation\nRework how objects are created, objects are now created after first connect after startup and updated after a firmware update",
        "de": "Musikreaktiver Modus hinzufügen\nUkrainische Übersetzung hinzufügen\nRework, wie Objekte erstellt werden, Objekte werden nun nach dem ersten Verbindungsaufbau nach dem Start erstellt und nach einem Firmware-Update aktualisiert",
        "ru": "Добавить музыкальный режим\nДобавить украинский перевод\nПереработайте, как создаются объекты, объекты теперь создаются после первого подключения после запуска и обновления после обновления прошивки",
        "pt": "Adicionar modo musicreactive\nAdicionar tradução ucraniana\nRetrabalhe como os objetos são criados, os objetos agora são criados após a primeira conexão após a inicialização e atualizados após uma atualização de firmware",
        "nl": "Voeg muziekreactie\nVertaling:\nReageer hoe objecten worden gecreëerd na de eerste verbinding na de start en update na een firmaware update",
        "fr": "Ajouter le mode musicréactif\nAjouter la traduction ukrainienne\nRetravailler la façon dont les objets sont créés, les objets sont maintenant créés après la première connexion après le démarrage et mis à jour après une mise à jour du firmware",
        "it": "Aggiungi la modalità musicareattiva\nAggiungi traduzione ucraina\nRipeti come vengono creati gli oggetti, gli oggetti vengono creati dopo la prima connessione dopo l'avvio e l'aggiornamento dopo un aggiornamento del firmware",
        "es": "Añadir modo músicareactivo\nAgregar traducción ucraniana\nRework how objects are created, objects are now created after first connect after startup and updated after a firmware update",
        "pl": "Mode reaktywny\nTłumaczenie ukraińskie\nZastosowanie tego, jak obiekty są tworzone, obecnie obiekty tworzone po pierwszym połączeniu po uruchomieniu i aktualizacji oprogramowania po aktualizacji oprogramowania",
        "uk": "Додати музичний режим\nДодати український переклад\nПереробити, як створюються об'єкти, об'єкти тепер створюються після першого підключення після запуску і оновлення після оновлення мікропрограми",
        "zh-cn": "增加音乐活动\n增加乌克兰翻译\n重新研究如何建立物体的工作,现在是在开始后和更新的第一连线之后建立物体。"
      },
      "1.0.7": {
        "en": "Fixed deprecated messages from Sentry with api-validations\nAutomatic switch mode had an error with playlists. Playlist item could never be selected.",
        "de": "Behobene deprecated Nachrichten von Sentry mit api-validierungen\nDer automatische Schaltermodus hatte einen Fehler mit Wiedergabelisten. Playlist Artikel konnte nie ausgewählt werden.",
        "ru": "Фиксированные обесцененные сообщения от Сентри с апи-валидациями\nАвтоматический режим переключателя имел ошибку с плейлистами. Пункт плейлиста никогда не может быть выбран.",
        "pt": "Corrigido mensagens deprecated de Sentry com api-validations\nO modo de interruptor automático teve um erro com listas de reprodução. item da lista de reprodução nunca poderia ser selecionado.",
        "nl": "Vertaling:\nAutomatische schakelaar had een fout met speellijsten. Playlist item kan nooit geselecteerd worden.",
        "fr": "Messages dépréciés fixes de Sentry avec api-validations\nLe mode de commutation automatique avait une erreur avec des playlists. L'élément Playlist ne pourrait jamais être sélectionné.",
        "it": "Fisso messaggi deprecati da Sentry con api-validations\nLa modalità di commutazione automatica ha avuto un errore con le playlist. La voce della lista di gioco non potrebbe mai essere selezionata.",
        "es": "Mensajes deprecatados fijos de Sentry con api-validaciones\nEl modo de conmutación automático tuvo un error con listas de reproducción. El artículo de la lista de reproducción nunca podría ser seleccionado.",
        "pl": "Zabronione wiadomości od Sentry z api-validation\nTryb automatycznego przełącznika miał błąd z listami odtwarzaczymi. Nie można było wybierać żadnego elementu.",
        "uk": "Фіксовані депресовані повідомлення від Sentry з api-validations\nАвтоматичний режим вимикача мав помилку зі списками відтворення. Плейлистовий елемент не можна вибрати.",
        "zh-cn": "Sentry有固定的电传器\n自动转换模式有误导者。 不能选择项目。."
      }
    },
    "titleLang": {
      "en": "Twinkly",
      "de": "Twinkly",
      "ru": "Твинкли",
      "pt": "Twinkly",
      "nl": "Twinkly",
      "fr": "Twinkly",
      "it": "Twinkly",
      "es": "Twinkly",
      "pl": "Twinkly",
      "zh-cn": "Twinkly",
      "uk": "мерехтить"
    },
    "desc": {
      "en": "Adapter to communicate with the Twinkly lights.",
      "de": "Adapter zur Kommunikation mit den Twinkly-Lichtern.",
      "ru": "Адаптер для связи с Twinkly lights.",
      "pt": "Adaptador para se comunicar com as luzes Twinkly.",
      "nl": "Adapter om te communiceren met de Twinkly Lights.",
      "fr": "Adaptateur pour communiquer avec les lumières Twinkly.",
      "it": "Adattatore per comunicare con le luci Twinkly.",
      "es": "Adaptador para comunicarse con las luces Twinkly.",
      "pl": "Adapter do komunikacji ze światłami Twinkly.",
      "zh-cn": "适配器与Twinkly灯通信。",
      "uk": "Адаптер для зв'язку з ліхтарями Twinkly."
    },
    "authors": [
      "patrickbs96 <patrickbsimon96@gmail.com>"
    ],
    "keywords": [
      "control",
      "lights"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "twinkly.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/patrickbs96/ioBroker.twinkly/master/admin/twinkly.png",
    "readme": "https://github.com/patrickbs96/ioBroker.twinkly/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "messagebox": true,
    "type": "lighting",
    "connectionType": "local",
    "dataSource": "poll",
    "compact": true,
    "materialize": true,
    "materializeTab": true,
    "adminUI": {
      "config": "materialize"
    },
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://3b050a32f5f74a32968fab1c58a7afad@o490501.ingest.sentry.io/5554454"
      }
    }
  },
  "native": {
    "devices": [],
    "interval": 60,
    "details": false,
    "mqtt": false,
    "network": false,
    "usePing": true,
    "switchMode": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
