{
  "common": {
    "name": "twinkly",
    "version": "0.2.12",
    "news": {
      "0.2.12": {
        "en": "Update dependencies",
        "de": "Abhängigkeiten aktualisieren",
        "ru": "Обновить зависимости",
        "pt": "Dependências de atualização",
        "nl": "Update afhankelijkheid",
        "fr": "Mettre à jour les dépendances",
        "it": "Dipendenze di aggiornamento",
        "es": "Actualizar las dependencias",
        "pl": "Zależności aktualnej",
        "zh-cn": "最新依赖"
      },
      "0.2.11": {
        "en": "Add setting to select which ledMode should be activated",
        "de": "Einstellung hinzufügen, um auszuwählen, welcher LEDMode aktiviert werden soll",
        "ru": "Добавьте настройку, чтобы выбрать, какой ledMode должен быть активирован",
        "pt": "Adicionar configuração para selecionar qual ledMode deve ser ativado",
        "nl": "Instelling toevoegen om te selecteren welke ledMode moet worden geactiveerd",
        "fr": "Ajouter un paramètre pour sélectionner quel ledMode doit être activé",
        "it": "Aggiungi impostazione per selezionare quale ledMode deve essere attivato",
        "es": "Agregar configuración para seleccionar qué ledMode debe activarse",
        "pl": "Dodaj ustawienie, aby wybrać, który tryb led powinien być aktywowany",
        "zh-cn": "添加设置以选择应激活哪个 ledMode"
      },
      "0.2.10": {
        "en": "Add setting to enable automatic switching Mode after State change (color, effect, movie, playlist)",
        "de": "Einstellung hinzufügen, um den automatischen Wechselmodus nach Statusänderung zu aktivieren (color, effect, movie, playlist)",
        "ru": "Добавить настройку для включения автоматического переключения режима после изменения состояния (color, effect, movie, playlist)",
        "pt": "Adicionar configuração para ativar o modo de troca automática após a mudança de estado (color, effect, movie, playlist)",
        "nl": "Instelling toevoegen om automatisch wisselen van modus mogelijk te maken na statuswijziging (color, effect, movie, playlist)",
        "fr": "Ajouter un paramètre pour activer le mode de commutation automatique après le changement d'état (color, effect, movie, playlist)",
        "it": "Aggiungi impostazione per abilitare la modalità di commutazione automatica dopo il cambio di stato (color, effect, movie, playlist)",
        "es": "Agregue la configuración para habilitar el modo de cambio automático después del cambio de estado (color, effect, movie, playlist)",
        "pl": "Dodaj ustawienie, aby włączyć automatyczne przełączanie trybu po zmianie stanu (color, effect, movie, playlist)",
        "zh-cn": "添加设置以启用状态更改后的自动切换模式（color、effect、movie、playlist）"
      },
      "0.2.7": {
        "en": "Hex without hash. Option to not use ping for reachability.",
        "de": "Hex ohne Hash. Option, Ping nicht für Erreichbarkeit zu verwenden.",
        "ru": "Hex без хеша. Возможность не использовать пинг для доступности.",
        "pt": "Hex sem hash. Opção de não usar ping para acessibilidade.",
        "nl": "Hex zonder hash. Optie om ping niet te gebruiken voor bereikbaarheid.",
        "fr": "Hex sans hachage. Option pour ne pas utiliser le ping pour l'accessibilité.",
        "it": "Esadecimale senza hash. Opzione per non utilizzare il ping per la raggiungibilità.",
        "es": "Hex sin hash. Opción de no usar ping para accesibilidad.",
        "pl": "Hex bez haszyszu. Opcja nieużywania polecenia ping dla osiągalności.",
        "zh-cn": "没有哈希的十六进制。选择不使用 ping 来实现可达性。"
      },
      "0.2.6": {
        "en": "Add Playlist Feature. Renamed Datapoints",
        "de": "Playlist-Funktion hinzufügen. Umbenannte Datenpunkte",
        "ru": "Добавить функцию списка воспроизведения. Переименованные точки данных",
        "pt": "Adicionar recurso de lista de reprodução. Pontos de dados renomeados",
        "nl": "Voeg afspeellijstfunctie toe. Hernoemde datapunten",
        "fr": "Ajouter une fonctionnalité de liste de lecture. Points de données renommés",
        "it": "Aggiungi funzione playlist. Punti dati rinominati",
        "es": "Agregar función de lista de reproducción. Puntos de datos renombrados",
        "pl": "Dodaj funkcję listy odtwarzania. Zmienione nazwy punktów danych",
        "zh-cn": "添加播放列表功能。重命名的数据点"
      },
      "0.2.4": {
        "en": "Handle wrong input so it does not cause exceptions",
        "de": "Behandeln Sie falsche Eingaben, damit keine Ausnahmen auftreten",
        "ru": "Обрабатывать неправильный ввод, чтобы не вызывать исключений",
        "pt": "Trate a entrada errada para não causar exceções",
        "nl": "Omgaan met verkeerde invoer zodat het geen uitzonderingen veroorzaakt",
        "fr": "Gérer les entrées erronées afin qu'elles ne provoquent pas d'exceptions",
        "it": "Gestire l'input sbagliato in modo che non causi eccezioni",
        "es": "Maneje la entrada incorrecta para que no cause excepciones",
        "pl": "Obsługuj nieprawidłowe dane wejściowe, aby nie powodowały wyjątków",
        "zh-cn": "处理错误的输入，以免引起异常"
      },
      "0.2.2": {
        "en": "Add Feature to change Color",
        "de": "Funktion hinzufügen, um die Farbe zu ändern",
        "ru": "Добавить функцию, чтобы изменить цвет",
        "pt": "Adicionar característica para mudar a cor",
        "nl": "Functie toevoegen om kleur te wijzigen",
        "fr": "Ajouter une fonctionnalité pour changer la couleur",
        "it": "Aggiungi funzionalità per cambiare colore",
        "es": "Agregar función para cambiar el color",
        "pl": "Dodaj funkcję, aby zmienić kolor",
        "zh-cn": "添加功能以更改颜色"
      }
    },
    "title": "Twinkly",
    "titleLang": {
      "en": "Twinkly",
      "de": "Twinkly",
      "ru": "Твинкли",
      "pt": "Twinkly",
      "nl": "Twinkly",
      "fr": "Twinkly",
      "it": "Twinkly",
      "es": "Twinkly",
      "pl": "Twinkly",
      "zh-cn": "Twinkly"
    },
    "desc": {
      "en": "Adapter to communicate with the Twinkly lights.",
      "de": "Adapter zur Kommunikation mit den Twinkly-Lichtern.",
      "ru": "Адаптер для связи с Twinkly lights.",
      "pt": "Adaptador para se comunicar com as luzes Twinkly.",
      "nl": "Adapter om te communiceren met de Twinkly Lights.",
      "fr": "Adaptateur pour communiquer avec les lumières Twinkly.",
      "it": "Adattatore per comunicare con le luci Twinkly.",
      "es": "Adaptador para comunicarse con las luces Twinkly.",
      "pl": "Adapter do komunikacji ze światłami Twinkly.",
      "zh-cn": "适配器与Twinkly灯通信。"
    },
    "authors": [
      "patrickbs96 <patrickbsimon96@gmail.com>"
    ],
    "keywords": [
      "control",
      "lights"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "twinkly.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/patrickbs96/ioBroker.twinkly/master/admin/twinkly.png",
    "readme": "https://github.com/patrickbs96/ioBroker.twinkly/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "lighting",
    "connectionType": "local",
    "dataSource": "poll",
    "compact": true,
    "materialize": true,
    "materializeTab": true,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://3b050a32f5f74a32968fab1c58a7afad@o490501.ingest.sentry.io/5554454"
      }
    }
  },
  "native": {
    "devices": [],
    "interval": 60,
    "details": false,
    "mqtt": false,
    "network": false,
    "usePing": true,
    "switchMode": false
  },
  "objects": [],
  "instanceObjects": []
}
